cyberluke/DiscogsApp/.arduino-build/sony_slink_esp32/sketch/sony_slink_esp32.ino.cpp
#line 1 "D:\\_LUKY\\DiscogsApp\\esp32\\arduino\\sony_slink_esp32\\sony_slink_esp32.ino"
#include <Arduino.h>
#ifdef ESP32
#include <WiFi.h>
#include <AsyncTCP.h>
#include <HTTPClient.h>
#elif defined(ESP8266)
#include <ESP8266WiFi.h>
#include <ESPAsyncTCP.h>
#include <ESP8266HTTPClient.h>
#endif
#include <ESPAsyncWebServer.h>

#include <stdlib.h>
#include <vector>
#include <functional>
#include <map>
#include <function_objects.h>
//#include <Process.h>

#define DEBUG_PULSES

// Webhook support
const char* serverName = "http://192.168.1.122:5000/webhook";  

const byte OUTPUT_PIN = 16; // 2
const byte INPUT_PIN = 17; // 3
const byte PULSE_BUFFER_SIZE = 200;

volatile unsigned long timeLowTransition = 0;
volatile byte bufferReadPosition = 0;
volatile byte bufferWritePosition = 0;
volatile byte pulseBuffer[PULSE_BUFFER_SIZE];

// Define a buffer to hold the incoming playlist data
char playlistBuffer[512]; // Adjust the size as needed for your data
int playlistBufferLength = 0;
int stopButtonCounter = 0;

// Global variables
std::vector<byte> messageBytes;
std::map<byte, FunctionObject<void(const std::vector<byte>&)>> commandHandlers;
// Global playlist and current position
std::vector<String> playlist;
unsigned int currentPlaylistPosition = 0;

int64_t startTime = 0;
int64_t alarmTime = 0;
bool isTimerEnabled = false;

#ifdef DEBUG_PULSES
String pulseLengths;
#endif

AsyncWebServer server(8080);
const char* ssid = "DILNA21";
const char* password = "nanotriko";
const char* PARAM_MESSAGE = "message";

#line 59 "D:\\_LUKY\\DiscogsApp\\esp32\\arduino\\sony_slink_esp32\\sony_slink_esp32.ino"
void notFound(AsyncWebServerRequest *request);
#line 95 "D:\\_LUKY\\DiscogsApp\\esp32\\arduino\\sony_slink_esp32\\sony_slink_esp32.ino"
void setup();
#line 166 "D:\\_LUKY\\DiscogsApp\\esp32\\arduino\\sony_slink_esp32\\sony_slink_esp32.ino"
void processBodyHandler(AsyncWebServerRequest *request, uint8_t *data, size_t len, size_t index, size_t total);
#line 179 "D:\\_LUKY\\DiscogsApp\\esp32\\arduino\\sony_slink_esp32\\sony_slink_esp32.ino"
String processBodyData(uint8_t *data, size_t len, size_t index, size_t total, String &bodyData);
#line 198 "D:\\_LUKY\\DiscogsApp\\esp32\\arduino\\sony_slink_esp32\\sony_slink_esp32.ino"
long readCurrentTimestamp();
#line 203 "D:\\_LUKY\\DiscogsApp\\esp32\\arduino\\sony_slink_esp32\\sony_slink_esp32.ino"
void processSlinkInput();
#line 273 "D:\\_LUKY\\DiscogsApp\\esp32\\arduino\\sony_slink_esp32\\sony_slink_esp32.ino"
void handleCommand(const std::vector<byte>& message);
#line 285 "D:\\_LUKY\\DiscogsApp\\esp32\\arduino\\sony_slink_esp32\\sony_slink_esp32.ino"
int hexStringToInt(String hexString);
#line 291 "D:\\_LUKY\\DiscogsApp\\esp32\\arduino\\sony_slink_esp32\\sony_slink_esp32.ino"
String intToHexString(int value);
#line 298 "D:\\_LUKY\\DiscogsApp\\esp32\\arduino\\sony_slink_esp32\\sony_slink_esp32.ino"
char nibbleToHexCharacter(byte nibble);
#line 304 "D:\\_LUKY\\DiscogsApp\\esp32\\arduino\\sony_slink_esp32\\sony_slink_esp32.ino"
int hexByteToDecimalInt(byte hexByte);
#line 316 "D:\\_LUKY\\DiscogsApp\\esp32\\arduino\\sony_slink_esp32\\sony_slink_esp32.ino"
void handleStopCommand(const std::vector<byte>& message);
#line 325 "D:\\_LUKY\\DiscogsApp\\esp32\\arduino\\sony_slink_esp32\\sony_slink_esp32.ino"
void handlePauseCommand(const std::vector<byte>& message);
#line 330 "D:\\_LUKY\\DiscogsApp\\esp32\\arduino\\sony_slink_esp32\\sony_slink_esp32.ino"
void handlePauseToggleCommand(const std::vector<byte>& message);
#line 335 "D:\\_LUKY\\DiscogsApp\\esp32\\arduino\\sony_slink_esp32\\sony_slink_esp32.ino"
void handleEjectCommand(const std::vector<byte>& message);
#line 340 "D:\\_LUKY\\DiscogsApp\\esp32\\arduino\\sony_slink_esp32\\sony_slink_esp32.ino"
void handlePlayCommand(const std::vector<byte>& message);
#line 401 "D:\\_LUKY\\DiscogsApp\\esp32\\arduino\\sony_slink_esp32\\sony_slink_esp32.ino"
void handle30SecCommand(const std::vector<byte>& message);
#line 424 "D:\\_LUKY\\DiscogsApp\\esp32\\arduino\\sony_slink_esp32\\sony_slink_esp32.ino"
void handleNextCommand(const std::vector<byte>& message);
#line 431 "D:\\_LUKY\\DiscogsApp\\esp32\\arduino\\sony_slink_esp32\\sony_slink_esp32.ino"
void handlePrevCommand(const std::vector<byte>& message);
#line 438 "D:\\_LUKY\\DiscogsApp\\esp32\\arduino\\sony_slink_esp32\\sony_slink_esp32.ino"
void playNextFromPlaylist();
#line 476 "D:\\_LUKY\\DiscogsApp\\esp32\\arduino\\sony_slink_esp32\\sony_slink_esp32.ino"
void onTrackFinish();
#line 481 "D:\\_LUKY\\DiscogsApp\\esp32\\arduino\\sony_slink_esp32\\sony_slink_esp32.ino"
bool isBusIdle();
#line 489 "D:\\_LUKY\\DiscogsApp\\esp32\\arduino\\sony_slink_esp32\\sony_slink_esp32.ino"
void sendPulseDelimiter();
#line 495 "D:\\_LUKY\\DiscogsApp\\esp32\\arduino\\sony_slink_esp32\\sony_slink_esp32.ino"
void sendSyncPulse();
#line 502 "D:\\_LUKY\\DiscogsApp\\esp32\\arduino\\sony_slink_esp32\\sony_slink_esp32.ino"
void sendBit(int bit);
#line 514 "D:\\_LUKY\\DiscogsApp\\esp32\\arduino\\sony_slink_esp32\\sony_slink_esp32.ino"
void sendByte(int value);
#line 521 "D:\\_LUKY\\DiscogsApp\\esp32\\arduino\\sony_slink_esp32\\sony_slink_esp32.ino"
void idleAfterCommand();
#line 526 "D:\\_LUKY\\DiscogsApp\\esp32\\arduino\\sony_slink_esp32\\sony_slink_esp32.ino"
bool sendCommand(byte command[], int commandLength);
#line 597 "D:\\_LUKY\\DiscogsApp\\esp32\\arduino\\sony_slink_esp32\\sony_slink_esp32.ino"
void loop();
#line 618 "D:\\_LUKY\\DiscogsApp\\esp32\\arduino\\sony_slink_esp32\\sony_slink_esp32.ino"
void readSLinkBuffer(int bytesRead);
#line 691 "D:\\_LUKY\\DiscogsApp\\esp32\\arduino\\sony_slink_esp32\\sony_slink_esp32.ino"
void httpPost(String jsonPayload);
#line 59 "D:\\_LUKY\\DiscogsApp\\esp32\\arduino\\sony_slink_esp32\\sony_slink_esp32.ino"
void notFound(AsyncWebServerRequest *request) {
    request->send(404, "text/plain", "Not found");
}

// This interrupt handler receives data from a remote slink device
void IRAM_ATTR busChange()
{
  static unsigned long timeOfPreviousInterrupt = 0;
  unsigned long timeNow = micros();

  if (timeNow - timeOfPreviousInterrupt < 100) {
    return;
  }
  timeOfPreviousInterrupt = timeNow;

 int busState = digitalRead(INPUT_PIN);
  if (busState == LOW) {
    timeLowTransition = timeNow;
    return;
  }

  // Bus is high. The time that the bus has been low determines what
  // has happened. Let's store this information for analysis outside
  // of the interrupt handler.
  int timeLow = timeNow - timeLowTransition;

  if ((bufferWritePosition + 1) % PULSE_BUFFER_SIZE == bufferReadPosition) {
    Serial.println(F("Pulse buffer overflow when receiving data"));
    return;
  }

  // Divide by 10 to make the pulse length fit in 8 bits
  pulseBuffer[bufferWritePosition] = std::min(255, timeLow / 10);
  bufferWritePosition = (bufferWritePosition + 1) % PULSE_BUFFER_SIZE;
}

void setup()
{
  Serial.begin(115200L);

  pinMode(OUTPUT_PIN, OUTPUT);
  digitalWrite(OUTPUT_PIN, LOW);
  pinMode(INPUT_PIN, INPUT);
  Serial.println("Booting User code...");
  // Setup command handlers
  commandHandlers[0x01] = handleStopCommand; // Command byte for 'Stop'
  commandHandlers[0x02] = handlePauseCommand; // Command byte for 'Pause'
  commandHandlers[0x03] = handlePauseToggleCommand; // Command byte for 'Pause toggle'
  commandHandlers[0x04] = handleEjectCommand; // Command byte for 'Eject'
  commandHandlers[0x08] = handleNextCommand; // Command byte for 'Next'  
  commandHandlers[0x09] = handlePrevCommand; // Command byte for 'Prev'  
  commandHandlers[0x50] = handlePlayCommand; // Command byte for 'Play'
  commandHandlers[0x0C] = handle30SecCommand; // Command byte for '30 sec remaining'
  // Add more command handlers as needed
  Serial.println("attach interrupt");
  //attachInterrupt(digitalPinToInterrupt(INPUT_PIN), busChange, CHANGE);
  attachInterrupt(digitalPinToInterrupt(INPUT_PIN), busChange, CHANGE);



  WiFi.mode(WIFI_STA);
    WiFi.begin(ssid, password);
    if (WiFi.waitForConnectResult() != WL_CONNECTED) {
        Serial.printf("WiFi Failed!\n");
        return;
    }

    Serial.print("IP Address: ");
    Serial.println(WiFi.localIP());

  startTime = readCurrentTimestamp();

