cyberluke/DiscogsApp/.arduino-build/sony_slink_esp32/sketch/sony_slink_esp32.ino.cpp
  server.on("/", HTTP_GET, [](AsyncWebServerRequest *request){
        request->send(200, "text/plain", "Hello, world");
    });

    // Send a GET request to <IP>/get?message=<message>
    server.on("/get", HTTP_GET, [] (AsyncWebServerRequest *request) {
        String message;
        if (request->hasParam(PARAM_MESSAGE)) {
            message = request->getParam(PARAM_MESSAGE)->value();
        } else {
            message = "No message sent";
        }
        request->send(200, "text/plain", "Hello, GET: " + message);
    });

    // Send a POST request to <IP>/post with a form field message set to <message>
    server.on("/post", HTTP_POST, [](AsyncWebServerRequest *request) {
        // request->send(200, "text/plain", "Hello, POST: " + message);
    }, [](AsyncWebServerRequest *request, const String& filename, size_t index, uint8_t *data, size_t len, bool final) {
        // upload
    }, [](AsyncWebServerRequest *request, uint8_t *data, size_t len, size_t index, size_t total) {
        processBodyHandler(request, data, len, index, total);
        request->send(200, "text/plain", "OK");
    });

    server.onRequestBody([](AsyncWebServerRequest *request, uint8_t *data, size_t len, size_t index, size_t total){
      processBodyHandler(request, data, len, index, total);
      request->send(200, "text/plain", "OK");
    });

    server.onNotFound(notFound);

    server.begin();
}

void processBodyHandler(AsyncWebServerRequest *request, uint8_t *data, size_t len, size_t index, size_t total) {
  static String bodyData;
  processBodyData(data, len, index, total, bodyData);
  // Convert String to char array using bodyData.length()
  size_t bodyLength = bodyData.length();
  bodyData.toCharArray(playlistBuffer, bodyLength + 1);
  
  // Ensure the buffer is null-terminated
  playlistBuffer[bodyLength] = '\0';
  playlistBufferLength = bodyLength;
  //readSLinkBuffer(bodyLength);  
}

String processBodyData(uint8_t *data, size_t len, size_t index, size_t total, String &bodyData) {
  if (index == 0) {
    bodyData = "";  // Initialize the bodyData string
  }
  
  // Append received data to bodyData
  bodyData += String((const char*)data).substring(0, len);

  if (index + len == total) {
    
    // Trim the bodyData to the specified length
    if (bodyData.length() > total) {
      bodyData = bodyData.substring(0, total);
    }
  }
  
  return bodyData;
}

long readCurrentTimestamp() {
  return esp_timer_get_time();
}


void processSlinkInput()
{
  static byte currentByte = 0;
  static byte currentBit = 0;
  static bool partialOutput = false;

  while (bufferReadPosition != bufferWritePosition) {
    int timeLow = pulseBuffer[bufferReadPosition] * 10;

    bufferReadPosition = (bufferReadPosition + 1) % PULSE_BUFFER_SIZE;

#ifdef DEBUG_PULSES
    if (timeLow > 2000) {
      pulseLengths = String();
    }
    else {
      pulseLengths += " ";
    }
    pulseLengths += String(timeLow, DEC);
#endif

    if (timeLow > 2000) {
      // 2400 us -> new data sequence

      if (partialOutput) {
        if (currentBit != 0) {
          Serial.print(F("!Discarding "));
          Serial.print(currentBit);
          Serial.print(F(" stray bits"));
        }

        Serial.print('\n');
        partialOutput = false;
      }

      currentBit = 0;
      continue;
    }

    partialOutput = true;
    currentBit += 1;
    if (timeLow > 900) {
      // 1200 us -> bit == 1
      bitSet(currentByte, 8 - currentBit);
    }
    else {
      // 600 us -> bit == 0
      bitClear(currentByte, 8 - currentBit);
    }

    if (currentBit == 8) {
      if (currentByte <= 0xF) {
        Serial.print(0, HEX);
      }
      Serial.print(currentByte, HEX);
      messageBytes.push_back(currentByte);
      currentBit = 0;
    }
  }

  if (partialOutput && isBusIdle()) {
    Serial.print('\n');
    partialOutput = false;
    if (messageBytes[0] == 0x98 || messageBytes[0] == 0x99 || messageBytes[0] == 0x9A || messageBytes[0] == 0x9B || messageBytes[0] == 0x9C || messageBytes[0] == 0x9D) {
      handleCommand(messageBytes);
    }
    messageBytes.clear(); // Clear the message bytes after handling
  }
}

void handleCommand(const std::vector<byte>& message) {
  if (message.size() < 2) return; // Ensure there's at least an ID and a command

  byte commandByte = message[1];
  if (commandHandlers.find(commandByte) != commandHandlers.end()) {
    commandHandlers[commandByte](message);
  } else {
    // Handle unknown command or ignore
  }
}

// Function to convert a hex string to an integer
int hexStringToInt(String hexString) {
  // strtol function converts the string to a long integer
  // Parameters: input string, reference to the string after the number, numerical base
  return (int)strtol(hexString.c_str(), NULL, 16);
}

String intToHexString(int value) {
  char hexString[5]; // 4 characters for the hex representation and one for the null terminator
  itoa(value, hexString, 16); // Convert the integer to a hex string
  return String(hexString); // Convert the char array to a String object and return it
}

// Function to convert a single nibble (4 bits) to a hexadecimal character
char nibbleToHexCharacter(byte nibble) {
  nibble &= 0x0F; // Ensure it's only 4 bits
  return nibble < 10 ? '0' + nibble : 'A' + nibble - 10;
}

// Function to convert a byte representing a hexadecimal value to an integer
int hexByteToDecimalInt(byte hexByte) {
  char str[3];
  
  // Convert each nibble to its ASCII character representation
  str[0] = nibbleToHexCharacter(hexByte >> 4);
  str[1] = nibbleToHexCharacter(hexByte);
  str[2] = '\0'; // Null-terminator for string

  // Convert the string to an integer
  return atoi(str);
}

void handleStopCommand(const std::vector<byte>& message) {
  stopButtonCounter = 0;
  httpPost("{\"status\":\"STOP\"}");
  if (isTimerEnabled) {
    isTimerEnabled = false;
    return;
  }
}

void handlePauseCommand(const std::vector<byte>& message) {
  isTimerEnabled = false;
  httpPost("{\"status\":\"PAUSE\"}");
}

void handlePauseToggleCommand(const std::vector<byte>& message) {
  isTimerEnabled = false;
  httpPost("{\"status\":\"PAUSE_TOGGLE\"}");
}

void handleEjectCommand(const std::vector<byte>& message) {
  isTimerEnabled = false;
  httpPost("{\"status\":\"EJECT\"}");
}

void handlePlayCommand(const std::vector<byte>& message) {
  Serial.println("Incoming PLAY command");

  if (isTimerEnabled) {
    onTrackFinish();
    isTimerEnabled = false;
    //return;
  }
  
  int messageSize = message.size();
  Serial.println("Message size: " + String(messageSize));

  Serial.println(hexByteToDecimalInt(message[2]));

  for (size_t i = 0; i < message.size(); ++i) {
    Serial.print(i);
    Serial.print(": ");
    Serial.println(message[i], HEX); // Print each byte in hexadecimal format
  }
  Serial.println("Handing PLAY command");
  //int64_t duration = (minutes * 60000ul) + (seconds * 1000ul); // Convert to ms

  int minutes = 0;
  int seconds = 0;
  if (messageSize >= 6) {
    // Extract timing information from the message
    // Assuming message[4] is minutes and message[5] is seconds
    Serial.println("converting minutes");
    minutes = hexByteToDecimalInt(message[4]);
    Serial.println(minutes);
    Serial.println("converting seconds");
    seconds = hexByteToDecimalInt(message[5]);
    Serial.println(seconds);
  }
  int64_t duration = (minutes * 60) + (seconds); // Convert to 
  // Set a timer to call onTrackFinish after the duration
  // You'll need to implement setTimer and onTrackFinish
  Serial.println("Duration: ");
  Serial.println(duration);

  // We Use handle30SecCommand() instead
  // TODO 3
  alarmTime = duration * 1000 * 1000; // convert to micro seconds
  startTime = readCurrentTimestamp();
  isTimerEnabled = true;

  int deckId = message[0];

  Serial.println("sending html get");

  char buffer[256];

  snprintf(buffer, sizeof(buffer), "{\"status\":\"PLAY\", \"device\":\"%02X\", \"cd\":\"%02X\", \"track\":\"%02X\", \"duration\":\"%lld\"}", deckId, messageSize >= 3 ? message[2] : 0, messageSize >= 4 ? message[3] : 0, static_cast<long long>(duration));

  // Convert the character buffer to a String
  String jsonString = String(buffer);
  httpPost(jsonString);


