cyberluke/DiscogsApp/.arduino-build/sony_slink_esp32/sketch/sony_slink_esp32.ino.cpp
}

void handle30SecCommand(const std::vector<byte>& message) {
  int64_t duration = 30; // Convert to ms

  // Set a timer to call onTrackFinish after the duration
  // You'll need to implement setTimer and onTrackFinish
  Serial.println("Duration: ");
  Serial.println(30);
  alarmTime = duration * 1000 * 1000;
  // Reset the timer if you want it to start counting again
  startTime = readCurrentTimestamp();
  isTimerEnabled = true;
  //Bridge.put("nextTrackTimer", duration);

  // Define a character buffer to hold the formatted string
  char buffer[128];

  snprintf(buffer, sizeof(buffer), "{\"status\":\"NEXT_TRACK_IN\", \"duration\":\"%lld\"}", static_cast<long long>(duration - 3));

  // Convert the character buffer to a String
  String jsonString = String(buffer);
  httpPost(jsonString); 
}

void handleNextCommand(const std::vector<byte>& message) {
  isTimerEnabled = false;

  //client.get("http://localhost:8080/nextTrack");
  httpPost("{\"status\":\"NEXT_TRACK\"}"); 
}

void handlePrevCommand(const std::vector<byte>& message) {
  isTimerEnabled = false;

  //client.get("http://localhost:8080/prevTrack");
  httpPost("{\"status\":\"PREV_TRACK\"}"); 
}

void playNextFromPlaylist() {
  Serial.println("playNextFromPlaylist() COMMAND:");
  Serial.println(currentPlaylistPosition);

  String command = playlist[currentPlaylistPosition];

  currentPlaylistPosition++;

  if (playlist.size() < currentPlaylistPosition) {
    currentPlaylistPosition = 0;
    command = playlist[currentPlaylistPosition];
    currentPlaylistPosition = 1;
  }

  Serial.println(command);

  // Logic to enqueue the new command to play a different disc and track
  byte commandBytes[command.length() / 2];
  for (int i = 0; i < sizeof(commandBytes); ++i) {
    String hexByte = command.substring(2 * i, 2 * i + 2);
    commandBytes[i] = strtol(hexByte.c_str(), NULL, 16);
  }

  if (!sendCommand(commandBytes, sizeof(commandBytes))) {
    // If send fails, re-queue command
    //bytesReceived = command + "\n" + bytesReceived;
    sendCommand(commandBytes, sizeof(commandBytes));
  }

      char buffer[256];

  snprintf(buffer, sizeof(buffer), "{\"status\":\"PREPARE_TRACK\", \"track\":\"%s\"}", command.c_str());

  // Convert the character buffer to a String
  String jsonString = String(buffer);
  httpPost(jsonString); // using PREPARE_TRACK instead of PLAY
}

void onTrackFinish() {
  Serial.println("onTrackFinish");
  playNextFromPlaylist();
}

bool isBusIdle()
{
  noInterrupts();
  bool isBusIdle = micros() - timeLowTransition > 1200 + 600 + 20000;
  interrupts();
  return isBusIdle;
}

void sendPulseDelimiter()
{
  digitalWrite(OUTPUT_PIN, LOW);
  delayMicroseconds(600);
}

void sendSyncPulse()
{
  digitalWrite(OUTPUT_PIN, HIGH);
  delayMicroseconds(2400);
  sendPulseDelimiter();
}

void sendBit(int bit)
{
  digitalWrite(OUTPUT_PIN, HIGH);
  if (bit) {
    delayMicroseconds(1200);
  }
  else {
    delayMicroseconds(600);
  }
  sendPulseDelimiter();
}

void sendByte(int value)
{
  for (int i = 7; i >= 0; --i) {
    sendBit(bitRead(value, i));
  }
}

void idleAfterCommand()
{
  delayMicroseconds(20000);
}

bool sendCommand(byte command[], int commandLength)
{
  if (!isBusIdle()) {
    return false;
  }

  noInterrupts();
  sendSyncPulse();
  for (int i = 0; i < commandLength; ++i) {
    sendByte(command[i]);
  }

  // Clear interrupt flags because interrupts triggered when we sent
  // the command and the interrupts are queued for processing once
  // interrupts are re-enabled.
  //EIFR = bit(INTF0) | bit(INTF1);
  // TODO

  interrupts();
  idleAfterCommand();
  return true;
}

//void processSerialInput()
//{
//  static String bytesReceived;
//
//  while (Serial.available()) {
//    bytesReceived += char(Serial.read());
//  }
//
//  const int eolPos = bytesReceived.indexOf("\n");
//  if (eolPos == -1) {
//    return;
//  }
//
//  const String command = bytesReceived.substring(0, eolPos);
//  bytesReceived.remove(0, command.length() + 1);
//
//#ifdef DEBUG_PULSES
//  if (command == "pulsedump") {
//    Serial.println(pulseLengths);
//    return;
//  }
//#endif
//
//  // A hexadecimal command is expected
//  if (command.length() % 2 != 0) {
//    Serial.println(F("Uneven length of Serial input"));
//    return;
//  }
//
//  for (int i = 0; i < command.length(); ++i) {
//    if (!isHexadecimalDigit(command[i])) {
//      Serial.println(F("Non-hexadecimal Serial input"));
//      return;
//    }
//  }
//
//  byte commandBytes[command.length() / 2];
//  for (int i = 0; i < sizeof(commandBytes); ++i) {
//    String hexByte = command.substring(2 * i, 2 * i + 2);
//    commandBytes[i] = strtol(hexByte.c_str(), NULL, 16);
//  }
//
//  if (!sendCommand(commandBytes, sizeof(commandBytes))) {
//    // If send fails, re-queue command
//    bytesReceived = command + "\n" + bytesReceived;
//  }
//}

void loop()
{
  processSlinkInput();
  //processSerialInput();

  if (playlistBufferLength > 0) {
    readSLinkBuffer(playlistBufferLength);
    playlistBufferLength = 0;
  }

  if (isTimerEnabled) {
    if (readCurrentTimestamp() - startTime >= alarmTime) {
      // Time to trigger the alarm
      Serial.println("Alarm!");
      onTrackFinish();
      isTimerEnabled = false;
    }
  }

}

void readSLinkBuffer(int bytesRead) {
  bool isPlaylist = false;
  bool hasReadData = false;

  if (bytesRead > 0) {
    hasReadData = true;
    // Ensure the buffer is null-terminated
    playlistBuffer[bytesRead] = '\0';

    // Process the playlist
    Serial.println("Received data buffer:");
    Serial.println(playlistBuffer);

    // Split the playlist into songs and print each song
    char* song = strtok(playlistBuffer, "\r\n");
    while (song != NULL) {
      if (strcmp(song, "PLAYLIST") == 0) {
        Serial.println("Receiving PLAYLIST");
        currentPlaylistPosition = 0;
        isPlaylist = true;
        isTimerEnabled = false;
        playlist.clear();
      } else {
        if (!isPlaylist) {
          playlist.clear(); // TODO
        }
        String command = String(song);
        // A hexadecimal command is expected
        if (command.length() % 2 != 0) {
          Serial.println(F("Uneven length of Serial input"));
          break;
        }

        for (int i = 0; i < command.length(); ++i) {
          if (!isHexadecimalDigit(command[i])) {
            Serial.println(F("Non-hexadecimal Serial input"));
            break;
          }
        }

        if (isPlaylist) {
          playlist.push_back(command);
          Serial.print("Song: ");
          Serial.println(song);
        } else {
          Serial.println(song);

          byte commandBytes[command.length() / 2];
          for (int i = 0; i < sizeof(commandBytes); ++i) {
            String hexByte = command.substring(2 * i, 2 * i + 2);
            commandBytes[i] = strtol(hexByte.c_str(), NULL, 16);
          }

          if (!sendCommand(commandBytes, sizeof(commandBytes))) {
            // If send fails, re-queue command
            sendCommand(commandBytes, sizeof(commandBytes));
          }
        }
      }
      song = strtok(NULL, "\r\n"); // Get the next song
    }

  }

  if (hasReadData) {
    // Clear the playlist after processing
    Serial.println("Clear the playlist after processing");
    if (isPlaylist) {
      onTrackFinish();
    }
  }
}

void httpPost(String jsonPayload) {
  // Check WiFi connection status
    if (WiFi.status() == WL_CONNECTED) {
        HTTPClient http;

        // Specify request destination
        http.begin(serverName);

        // Specify content type header
        http.addHeader("Content-Type", "application/json");

        // Send HTTP POST request
        int httpResponseCode = http.POST(jsonPayload);

        // Check the returning code
        if (httpResponseCode > 0) {
            Serial.print("HTTP Response code: ");
            Serial.println(httpResponseCode);

            // Get the response payload
            String response = http.getString();
            Serial.print("Response: ");
            Serial.println(response);
        }
        else {
            Serial.print("Error code: ");
            Serial.println(httpResponseCode);
        }

        // Free resources
        http.end();
    }
}

